qmk-arterytek/ChibiOS-Contrib/os/hal/ports/AT32/AT32F405/at32_registry.h
#define AT32_HAS_I2C3                      TRUE
#define AT32_I2C_I2C3_RX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY
#define AT32_I2C_I2C3_TX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY

/* ERTC attributes.*/
#define AT32_HAS_ERTC                      TRUE
#define AT32_ERTC_HAS_SUBSECONDS           TRUE
#define AT32_ERTC_HAS_PERIODIC_WAKEUPS     TRUE
#define AT32_ERTC_NUM_ALARMS               2
#define AT32_ERTC_STORAGE_SIZE             80

/* QUADSPI attributes.*/
#define AT32_HAS_QUADSPI1                  TRUE
#define AT32_WSPI_QUADSPI1_DMA_STREAM      AT32_DMA_STREAM_ID_ANY

/* SDIO attributes.*/
#define AT32_HAS_SDIO                      FALSE

/* SPI attributes.*/
#define AT32_HAS_SPI1                      TRUE
#define AT32_SPI1_SUPPORTS_I2S             TRUE
#define AT32_SPI1_I2S_FULLDUPLEX           TRUE
#define AT32_SPI_SPI1_RX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY
#define AT32_SPI_SPI1_TX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_SPI2                      TRUE
#define AT32_SPI2_SUPPORTS_I2S             TRUE
#define AT32_SPI2_I2S_FULLDUPLEX           TRUE
#define AT32_SPI_SPI2_RX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY
#define AT32_SPI_SPI2_TX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_SPI3                      TRUE
#define AT32_SPI3_SUPPORTS_I2S             TRUE
#define AT32_SPI3_I2S_FULLDUPLEX           TRUE
#define AT32_SPI_SPI3_RX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY
#define AT32_SPI_SPI3_TX_DMA_STREAM        AT32_DMA_STREAM_ID_ANY

/* TMR attributes.*/
#define AT32_TMR_MAX_CHANNELS              4

#define AT32_HAS_TMR1                      TRUE
#define AT32_TMR1_IS_32BITS                FALSE
#define AT32_TMR1_CHANNELS                 4

#define AT32_HAS_TMR2                      TRUE
#define AT32_TMR2_IS_32BITS                TRUE
#define AT32_TMR2_CHANNELS                 4

#define AT32_HAS_TMR3                      TRUE
#define AT32_TMR3_IS_32BITS                FALSE
#define AT32_TMR3_CHANNELS                 4

#define AT32_HAS_TMR4                      TRUE
#define AT32_TMR4_IS_32BITS                FALSE
#define AT32_TMR4_CHANNELS                 4

#define AT32_HAS_TMR6                      TRUE
#define AT32_TMR6_IS_32BITS                FALSE
#define AT32_TMR6_CHANNELS                 0

#define AT32_HAS_TMR7                      TRUE
#define AT32_TMR7_IS_32BITS                FALSE
#define AT32_TMR7_CHANNELS                 0

#define AT32_HAS_TMR9                      TRUE
#define AT32_TMR9_IS_32BITS                FALSE
#define AT32_TMR9_CHANNELS                 2

#define AT32_HAS_TMR10                     TRUE
#define AT32_TMR10_IS_32BITS               FALSE
#define AT32_TMR10_CHANNELS                1

#define AT32_HAS_TMR11                     TRUE
#define AT32_TMR11_IS_32BITS               FALSE
#define AT32_TMR11_CHANNELS                1

#define AT32_HAS_TMR13                     TRUE
#define AT32_TMR13_IS_32BITS               FALSE
#define AT32_TMR13_CHANNELS                1

#define AT32_HAS_TMR14                     TRUE
#define AT32_TMR14_IS_32BITS               FALSE
#define AT32_TMR14_CHANNELS                1

#define AT32_HAS_TMR5                      FALSE

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_USART2                    TRUE
#define AT32_UART_USART2_RX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY
#define AT32_UART_USART2_TX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_USART3                    TRUE
#define AT32_UART_USART3_RX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY
#define AT32_UART_USART3_TX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_UART4                     TRUE
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_UART5                     TRUE
#define AT32_UART_UART5_RX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY
#define AT32_UART_UART5_TX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_USART6                    TRUE
#define AT32_UART_USART6_RX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY
#define AT32_UART_USART6_TX_DMA_STREAM     AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_UART7                     TRUE
#define AT32_UART_UART7_RX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY
#define AT32_UART_UART7_TX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY

#define AT32_HAS_UART8                     TRUE
#define AT32_UART_UART8_RX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY
#define AT32_UART_UART8_TX_DMA_STREAM      AT32_DMA_STREAM_ID_ANY

/* USB attributes.*/
#define AT32_OTG_STEPPING                  2

#define AT32_HAS_OTG1                      TRUE
#define AT32_OTG1_ENDPOINTS                8

#define AT32_HAS_OTG2                      TRUE
#define AT32_OTG2_ENDPOINTS                8

/* WDT attributes.*/
#define AT32_HAS_WDT                       TRUE
#define AT32_WDT_IS_WINDOWED               TRUE
/** @} */
#endif /* defined(AT32F405R_HD) */

#endif /* AT32_REGISTRY_H */

/** @} */
